[
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "Whoever says it in the morning is protected from the jinn until the evening, and whoever says it in the evening is protected from the jinn until the morning.",
        "reference": "Ayat al-Kursi - Surah Al-Baqarah 255",
        "search": "Morning Remembrances",
        "zekr": "I seek refuge in Allah from the accursed Satan\nAllah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "Whoever says it in the morning and in the evening is sufficient for everything (Al-Ikhlas and the Mu'awwidhatayn).",
        "reference": "Surah Al-Ikhlas",
        "search": "Morning Remembrances",
        "zekr": "In the name of Allah, the Most Gracious, the Most Merciful\nSay, 'He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent.'"
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "Whoever says it in the morning and in the evening is sufficient for everything (Al-Ikhlas and the Mu'awwidhatayn).",
        "reference": "Surah Al-Falaq",
        "search": "Morning Remembrances",
        "zekr": "In the name of Allah, the Most Gracious, the Most Merciful\nSay, 'I seek refuge in the Lord of daybreak From the evil of that which He created And from the evil of darkness when it settles And from the evil of the blowers in knots And from the evil of an envier when he envies.'"
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "Whoever says it in the morning and in the evening is sufficient for everything (Al-Ikhlas and the Mu'awwidhatayn).",
        "reference": "Surah An-Nas",
        "search": "Morning Remembrances",
        "zekr": "In the name of Allah, the Most Gracious, the Most Merciful\nSay, 'I seek refuge in the Lord of mankind, The Sovereign of mankind. The God of mankind, From the evil of the retreating whisperer - Who whispers [evil] into the breasts of mankind - From among the jinn and mankind.'"
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "",
        "reference": "Muslim",
        "search": "Morning Remembrances",
        "zekr": "We have reached the morning and at this very time unto Allah belongs all sovereignty, all praise is for Allah. None has the right to be worshipped except Allah, alone without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this day and the good of what follows it and I take refuge in You from the evil of this day and the evil of what follows it. My Lord, I take refuge in You from laziness and senility. My Lord, I take refuge in You from torment in the Fire and punishment in the grave."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "Whoever says it with certainty in the evening and dies that night will enter Paradise, and likewise in the morning.",
        "reference": "Al-Bukhari",
        "search": "Morning Remembrances",
        "zekr": "O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I have committed. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for verily none can forgive sin except You."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "Whoever says it in the morning and in the evening, it is incumbent upon Allah to please him on the Day of Resurrection.",
        "reference": "Ahmad",
        "search": "Morning Remembrances",
        "zekr": "I am pleased with Allah as a Lord, and Islam as a religion and Muhammad peace be upon him as a Prophet."
    },
    {
        "category": "Morning Remembrances",
        "count": 4,
        "description": "Whoever says it, Allah will free him from the Fire.",
        "reference": "Abu Dawood",
        "search": "Morning Remembrances",
        "zekr": "O Allah, I have reached the morning and call You, the bearers of Your throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner and that Muhammad is Your Servant and Messenger."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "Whoever says it in the morning has fulfilled the thanks of his day.",
        "reference": "Abu Dawood",
        "search": "Morning Remembrances",
        "zekr": "O Allah, whatever blessing I or any of Your creation have risen upon, is from You alone, without partner, so for You is all praise and unto You all thanks."
    },
    {
        "category": "Morning Remembrances",
        "count": 7,
        "description": "Whoever says it, Allah will suffice him in what concerns him of the affairs of this world and the Hereafter.",
        "reference": "Ibn Al-Sunni",
        "search": "Morning Remembrances",
        "zekr": "Allah is Sufficient for me, none has the right to be worshipped except Him, upon Him I rely and He is Lord of the exalted throne."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "Nothing will harm him from Allah.",
        "reference": "Ibn Majah",
        "search": "Morning Remembrances",
        "zekr": "In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Morning Remembrances",
        "zekr": "O Allah, by your leave we have reached the morning and by Your leave we have reached the evening, by Your leave we live and die and unto You is our resurrection."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "",
        "reference": "Ahmad",
        "search": "Morning Remembrances",
        "zekr": "We have reached the morning upon the natural faith of Islam, and upon the word of pure faith, and upon the religion of our Prophet Muhammad (peace be upon him), and the faith of our forefather Ibraheem, who was a Muslim and of true faith and was not of those who associate others with Allah."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "Muslim",
        "search": "Morning Remembrances",
        "zekr": "How perfect Allah is and I praise Him by the number of His creation and His pleasure, and by the weight of His throne, and the ink of His words."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "Ahmad",
        "search": "Morning Remembrances",
        "zekr": "O Allah, grant my body health, O Allah, grant my hearing health, O Allah, grant my sight health. None has the right to be worshipped except You."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Morning Remembrances",
        "zekr": "O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave. None has the right to be worshipped except You."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "",
        "reference": "Abu Dawood",
        "search": "Morning Remembrances",
        "zekr": "O Allah, I ask You for pardon and well-being in this life and the next. O Allah, I ask You for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge with You lest I be swallowed up by the earth."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Morning Remembrances",
        "zekr": "O Ever Living, O Self-Subsisting and Supporter of all, by Your mercy I seek assistance, rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "",
        "reference": "Abu Dawood",
        "search": "Morning Remembrances",
        "zekr": "We have reached the morning and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of this day, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of this day and the evil that follows it."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Morning Remembrances",
        "zekr": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the Earth, Lord and Sovereign of all things, I bear witness that none has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Morning Remembrances",
        "zekr": "I take refuge in Allah's perfect words from the evil He has created."
    },
    {
        "category": "Morning Remembrances",
        "count": 10,
        "description": "Whoever sends blessings upon me in the morning and in the evening will receive my intercession on the Day of Resurrection.",
        "reference": "Al-Tabarani",
        "search": "Morning Remembrances",
        "zekr": "O Allah, send blessings, peace and mercy upon our Prophet Muhammad."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Morning Remembrances",
        "zekr": "O Allah, we seek refuge in You from associating anything with You knowingly, and we seek Your forgiveness for what we do unknowingly."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "Abu Dawood",
        "search": "Morning Remembrances",
        "zekr": "O Allah, I seek refuge with You from worry and grief, from incapacity and laziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by men."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Morning Remembrances",
        "zekr": "I seek forgiveness from Allah the Almighty, whom there is none worthy of worship except Him, the Ever-Living, the Sustainer of existence, and I repent to Him."
    },
    {
        "category": "Morning Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Morning Remembrances",
        "zekr": "O Lord, praise is for You as befits the majesty of Your Face and the greatness of Your authority."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "",
        "reference": "Ibn Majah",
        "search": "Morning Remembrances",
        "zekr": "O Allah, I ask You for beneficial knowledge, good provision, and acceptable deeds."
    },
    {
        "category": "Morning Remembrances",
        "count": 1,
        "description": "A good remembrance.",
        "reference": "",
        "search": "Morning Remembrances",
        "zekr": "O Allah, You are my Lord, there is no god but You. I put my trust in You, and You are the Lord of the Mighty Throne. What Allah wills happens, and what He does not will does not happen. There is no power or strength except with Allah, the Most High, the Most Great. I know that Allah has power over all things, and that Allah's knowledge encompasses all things. O Allah, I seek refuge in You from the evil of my soul and from the evil of every creature whose forelock You hold. Indeed, my Lord is on a straight path."
    },
    {
        "category": "Morning Remembrances",
        "count": 100,
        "description": "Whoever says it 100 times in a day, it will be as if he freed ten slaves, and one hundred good deeds will be written for him, and one hundred sins will be erased from him, and it will be a shield for him from Satan that day until evening, and no one will come with anything better than what he brought except one who does more than that.",
        "reference": "Al-Tirmidhi",
        "search": "Morning Remembrances",
        "zekr": "There is no god but Allah alone, with no partner. To Him belongs sovereignty and to Him belongs praise, and He is over all things competent."
    },
    {
        "category": "Morning Remembrances",
        "count": 100,
        "description": "His sins will be erased even if they were like the foam of the sea. No one will come on the Day of Resurrection with anything better except one who says the same or more.",
        "reference": "Muslim",
        "search": "Morning Remembrances",
        "zekr": "Glory be to Allah and praise be to Him."
    },
    {
        "category": "Morning Remembrances",
        "count": 100,
        "description": "One hundred good deeds, one hundred sins erased, and a shield from Satan until evening.",
        "reference": "Al-Bukhari",
        "search": "Morning Remembrances",
        "zekr": "I seek forgiveness from Allah and repent to Him."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "Whoever says it in the morning is protected from the jinn until the evening, and whoever says it in the evening is protected from the jinn until the morning.",
        "reference": "Ayat al-Kursi - Surah Al-Baqarah 255",
        "search": "Evening Remembrances",
        "zekr": "I seek refuge in Allah from the accursed Satan\nAllah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "Whoever recites the last two verses of Surah Al-Baqarah at night, they will suffice him.",
        "reference": "Surah Al-Baqarah 285 - 286",
        "search": "Evening Remembrances",
        "zekr": "I seek refuge in Allah from the accursed Satan\nThe Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], 'We make no distinction between any of His messengers.' And they say, 'We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.' Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. 'Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.'"
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "Whoever says it in the morning and in the evening is sufficient for everything (Al-Ikhlas and the Mu'awwidhatayn).",
        "reference": "Surah Al-Ikhlas",
        "search": "Evening Remembrances",
        "zekr": "In the name of Allah, the Most Gracious, the Most Merciful\nSay, 'He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent.'"
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "Surah Al-Falaq",
        "search": "Evening Remembrances",
        "zekr": "In the name of Allah, the Most Gracious, the Most Merciful\nSay, 'I seek refuge in the Lord of daybreak From the evil of that which He created And from the evil of darkness when it settles And from the evil of the blowers in knots And from the evil of an envier when he envies.'"
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "Surah An-Nas",
        "search": "Evening Remembrances",
        "zekr": "In the name of Allah, the Most Gracious, the Most Merciful\nSay, 'I seek refuge in the Lord of mankind, The Sovereign of mankind. The God of mankind, From the evil of the retreating whisperer - Who whispers [evil] into the breasts of mankind - From among the jinn and mankind.'"
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "",
        "reference": "Muslim",
        "search": "Evening Remembrances",
        "zekr": "We have reached the evening and at this very time unto Allah belongs all sovereignty, all praise is for Allah. None has the right to be worshipped except Allah, alone without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this night and the good of what follows it and I take refuge in You from the evil of this night and the evil of what follows it. My Lord, I take refuge in You from laziness and senility. My Lord, I take refuge in You from torment in the Fire and punishment in the grave."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "Whoever says it with certainty in the evening and dies that night will enter Paradise, and likewise in the morning.",
        "reference": "Al-Bukhari",
        "search": "Evening Remembrances",
        "zekr": "O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I have committed. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for verily none can forgive sin except You."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "Whoever says it in the morning and in the evening, it is incumbent upon Allah to please him on the Day of Resurrection.",
        "reference": "Ahmad",
        "search": "Evening Remembrances",
        "zekr": "I am pleased with Allah as a Lord, and Islam as a religion and Muhammad peace be upon him as a Prophet."
    },
    {
        "category": "Evening Remembrances",
        "count": 4,
        "description": "Whoever says it, Allah will free him from the Fire.",
        "reference": "Abu Dawood",
        "search": "Evening Remembrances",
        "zekr": "O Allah, I have reached the evening and call You, the bearers of Your throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner and that Muhammad is Your Servant and Messenger."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "Whoever says it in the evening has fulfilled the thanks of his day.",
        "reference": "Abu Dawood",
        "search": "Evening Remembrances",
        "zekr": "O Allah, whatever blessing I or any of Your creation have risen upon, is from You alone, without partner, so for You is all praise and unto You all thanks."
    },
    {
        "category": "Evening Remembrances",
        "count": 7,
        "description": "Whoever says it, Allah will suffice him in what concerns him of the affairs of this world and the Hereafter.",
        "reference": "Ibn Al-Sunni",
        "search": "Evening Remembrances",
        "zekr": "Allah is Sufficient for me, none has the right to be worshipped except Him, upon Him I rely and He is Lord of the exalted throne."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "Nothing will harm him from Allah.",
        "reference": "Ibn Majah",
        "search": "Evening Remembrances",
        "zekr": "In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Evening Remembrances",
        "zekr": "O Allah, by your leave we have reached the evening and by Your leave we have reached the morning, by Your leave we live and die and unto You is our return."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "",
        "reference": "Ahmad",
        "search": "Evening Remembrances",
        "zekr": "We have reached the evening upon the natural faith of Islam, and upon the word of pure faith, and upon the religion of our Prophet Muhammad (peace be upon him), and the faith of our forefather Ibraheem, who was a Muslim and of true faith and was not of those who associate others with Allah."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "Muslim",
        "search": "Evening Remembrances",
        "zekr": "How perfect Allah is and I praise Him by the number of His creation and His pleasure, and by the weight of His throne, and the ink of His words."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "Ahmad",
        "search": "Evening Remembrances",
        "zekr": "O Allah, grant my body health, O Allah, grant my hearing health, O Allah, grant my sight health. None has the right to be worshipped except You."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Evening Remembrances",
        "zekr": "O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave. None has the right to be worshipped except You."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "",
        "reference": "Abu Dawood",
        "search": "Evening Remembrances",
        "zekr": "O Allah, I ask You for pardon and well-being in this life and the next. O Allah, I ask You for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge with You lest I be swallowed up by the earth."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Evening Remembrances",
        "zekr": "O Ever Living, O Self-Subsisting and Supporter of all, by Your mercy I seek assistance, rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "",
        "reference": "Abu Dawood",
        "search": "Evening Remembrances",
        "zekr": "We have reached the evening and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of this night, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of this night and the evil that follows it."
    },
    {
        "category": "Evening Remembrances",
        "count": 1,
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Evening Remembrances",
        "zekr": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the Earth, Lord and Sovereign of all things, I bear witness that none has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Evening Remembrances",
        "zekr": "I take refuge in Allah's perfect words from the evil He has created."
    },
    {
        "category": "Evening Remembrances",
        "count": 10,
        "description": "Whoever sends blessings upon me in the morning and in the evening will receive my intercession on the Day of Resurrection.",
        "reference": "Al-Tabarani",
        "search": "Evening Remembrances",
        "zekr": "O Allah, send blessings, peace and mercy upon our Prophet Muhammad."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Evening Remembrances",
        "zekr": "O Allah, we seek refuge in You from associating anything with You knowingly, and we seek Your forgiveness for what we do unknowingly."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "Abu Dawood",
        "search": "Evening Remembrances",
        "zekr": "O Allah, I seek refuge with You from worry and grief, from incapacity and laziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by men."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Evening Remembrances",
        "zekr": "I seek forgiveness from Allah the Almighty, whom there is none worthy of worship except Him, the Ever-Living, the Sustainer of existence, and I repent to Him."
    },
    {
        "category": "Evening Remembrances",
        "count": 3,
        "description": "",
        "reference": "",
        "search": "Evening Remembrances",
        "zekr": "O Lord, praise is for You as befits the majesty of Your Face and the greatness of Your authority."
    },
    {
        "category": "Evening Remembrances",
        "count": 100,
        "description": "It will be as if he freed ten slaves, one hundred good deeds will be written for him, one hundred sins erased, and a shield from Satan.",
        "reference": "Al-Tirmidhi",
        "search": "Evening Remembrances",
        "zekr": "There is no god but Allah alone, with no partner. To Him belongs sovereignty and to Him belongs praise, and He is over all things competent."
    },
    {
        "category": "Evening Remembrances",
        "count": 100,
        "description": "His sins will be erased even if they were like the foam of the sea.",
        "reference": "Muslim",
        "search": "Evening Remembrances",
        "zekr": "Glory be to Allah and praise be to Him."
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Al-Bukhari",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "The Prophet (peace be upon him) said: 'Whoever says: Glory be to Allah and praise be to Him one hundred times in a day, his sins will be erased even if they were like the foam of the sea.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Al-Bukhari",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "And he (peace be upon him) said: 'Whoever says: There is no god but Allah alone, no partner for Him, to Him belongs sovereignty, and to Him belongs praise, and He is over all things competent, ten times, it is as if he freed four souls from the descendants of Ishmael.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Al-Bukhari",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "And he (peace be upon him) said: 'Two words that are light on the tongue, heavy on the scale, beloved to the Most Merciful: Glory be to Allah and praise be to Him, Glory be to Allah the Great.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "And he (peace be upon him) said: 'To say: Glory be to Allah, Praise be to Allah, There is no god but Allah, Allah is the Greatest, is more beloved to me than everything the sun rises upon.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "And he (peace be upon him) said: 'Is one of you unable to earn one thousand good deeds every day?' One of his companions asked: 'How can one of us earn one thousand good deeds?' He said: 'Glorify one hundred times, and one thousand good deeds will be written for him or one thousand sins will be erased from him.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "'Whoever says: Glory be to Allah the Great and praise be to Him, a palm tree will be planted for him in Paradise.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Al-Bukhari",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "And he (peace be upon him) said: 'O Abdullah bin Qais, shall I not guide you to a treasure from the treasures of Paradise?' I said: 'Yes, O Messenger of Allah.' He said: 'Say: There is no power or strength except with Allah.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "And he (peace be upon him) said: 'The most beloved words to Allah are four: Glory be to Allah, Praise be to Allah, There is no god but Allah, Allah is the Greatest. It does not harm you which one you start with.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "A Bedouin came to the Messenger of Allah (peace be upon him) and said: 'Teach me words to say.' He said: 'Say: There is no god but Allah alone, no partner for Him, Allah is the Greatest, much praise be to Allah, Glory be to Allah Lord of the worlds, There is no power or strength except with Allah the Almighty the Wise.' He said: 'These are for my Lord, what about for me?' He said: 'Say: O Allah, forgive me, have mercy on me, guide me, provide for me.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "When a man embraced Islam, the Prophet (peace be upon him) taught him prayer, then ordered him to supplicate with these words: 'O Allah, forgive me, have mercy on me, guide me, grant me health, and provide for me.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "'Indeed, the best supplication is praise to Allah, and the best remembrance is There is no god but Allah.'"
    },
    {
        "category": "Tasbih, Tahmid, Tahlil, Takbir",
        "count": "",
        "description": "",
        "reference": "Ahmad",
        "search": "Tasbih, Tahmid, Tahlil, Takbir",
        "zekr": "The enduring good deeds: Glory be to Allah, Praise be to Allah, There is no god but Allah, Allah is the Greatest, There is no power or strength except with Allah."
    },
    {
        "category": "How did the Prophet perform Tasbih?",
        "count": "",
        "description": "",
        "reference": "",
        "search": "How did the Prophet perform Tasbih?",
        "zekr": "From Abdullah bin Amr (may Allah be pleased with him), he said: 'I saw the Prophet (peace be upon him) counting the Tasbih.' And in addition: 'With his right hand.'"
    },
    {
        "category": "From the Types of Good and Comprehensive Etiquettes",
        "count": "",
        "description": "",
        "reference": "",
        "search": "From the Types of Good and Comprehensive Etiquettes - Night Sleep",
        "zekr": "The Prophet (peace be upon him) said: 'When it is the darkness of night - or when you reach evening - restrain your children, for the devils spread out at that time. When an hour of the night passes, release them. Close the doors and mention the name of Allah, for Satan does not open a closed door. Tie your water skins and mention the name of Allah. Cover your vessels and mention the name of Allah, even if you place something across it, and extinguish your lamps.'"
    },
    {
        "category": "Legitimate Ruqyah from the Holy Quran",
        "count": "",
        "description": "",
        "reference": "",
        "search": "Legitimate Ruqyah from the Holy Quran",
        "zekr": "In the name of Allah, the Most Gracious, the Most Merciful (1) [All] praise is [due] to Allah, Lord of the worlds - (2) The Most Gracious, the Most Merciful, (3) Sovereign of the Day of Recompense. (4) It is You we worship and You we ask for help. (5) Guide us to the straight path - (6) The path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray. (7)."
    },
    {
        "category": "Legitimate Ruqyah from the Holy Quran",
        "count": "",
        "description": "",
        "reference": "",
        "search": "Legitimate Ruqyah from the Holy Quran",
        "zekr": "Alif, Lam, Meem. (1) This is the Book about which there is no doubt, a guidance for those conscious of Allah - (2) Who believe in the unseen, establish prayer, and spend out of what We have provided for them, (3) And who believe in what has been revealed to you, [O Muhammad], and what was revealed before you, and of the Hereafter they are certain [in faith]. (4) Those are upon [right] guidance from their Lord, and it is those who are the successful. (5)."
    },
    {
        "category": "Legitimate Ruqyah from the Holy Quran",
        "count": "",
        "description": "",
        "reference": "",
        "search": "Legitimate Ruqyah from the Holy Quran",
        "zekr": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great."
    },
    {
        "category": "Legitimate Ruqyah from the Holy Quran",
        "count": "",
        "description": "",
        "reference": "",
        "search": "Legitimate Ruqyah from the Holy Quran",
        "zekr": "To Allah belongs whatever is in the heavens and whatever is in the earth. And whether you show what is within yourselves or conceal it, Allah will bring you to account for it. Then He will forgive whom He wills and punish whom He wills, and Allah is over all things competent. (284) The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], 'We make no distinction between any of His messengers.' And they say, 'We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.' (285) Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. 'Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.' (286)."
    },
    {
        "category": "Legitimate Ruqyah from the Holy Quran",
        "count": "",
        "description": "",
        "reference": "",
        "search": "Legitimate Ruqyah from the Holy Quran",
        "zekr": "Say, 'O disbelievers, (1) I do not worship what you worship. (2) Nor are you worshippers of what I worship. (3) Nor will I be a worshipper of what you worship. (4) Nor will you be worshippers of what I worship. (5) For you is your religion, and for me is my religion.' (6)."
    },
    {
        "category": "Legitimate Ruqyah from the Holy Quran",
        "count": "",
        "description": "",
        "reference": "",
        "search": "Legitimate Ruqyah from the Holy Quran",
        "zekr": "Say, 'He is Allah, [who is] One, (1) Allah, the Eternal Refuge. (2) He neither begets nor is born, (3) Nor is there to Him any equivalent.' (4)."
    },
    {
        "category": "Legitimate Ruqyah from the Holy Quran",
        "count": "",
        "description": "",
        "reference": "",
        "search": "Legitimate Ruqyah from the Holy Quran",
        "zekr": "Say, 'I seek refuge in the Lord of daybreak (1) From the evil of that which He created (2) And from the evil of darkness when it settles (3) And from the evil of the blowers in knots (4) And from the evil of an envier when he envies.' (5)."
    },
    {
        "category": "Legitimate Ruqyah from the Holy Quran",
        "count": "",
        "description": "",
        "reference": "",
        "search": "Legitimate Ruqyah from the Holy Quran",
        "zekr": "Say, 'I seek refuge in the Lord of mankind, (1) The Sovereign of mankind. (2) The God of mankind, (3) From the evil of the retreating whisperer - (4) Who whispers [evil] into the breasts of mankind - (5) From among the jinn and mankind.' (6)."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "If he says that, Satan says: 'He is protected from me for the rest of the day.'",
        "reference": "Abu Dawood",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "I seek refuge in Allah the Almighty, and in His Noble Face, and in His Eternal Dominion, from the accursed Satan."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "I seek refuge in Allah from the accursed Satan, from his madness, his arrogance, and his poetry."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Al-Bukhari",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "I seek refuge in the perfect words of Allah, from every devil and every poisonous reptile, and from every evil eye."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "I seek refuge in the perfect words of Allah from the evil of what He has created."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "In the name of Allah, I perform Ruqyah for you, from everything that is harming you, from the evil of every soul or envious eye, may Allah heal you, in the name of Allah I perform Ruqyah for you."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "In the name of Allah (three times), I seek refuge in Allah and His power from the evil of what I find and what I fear (seven times)."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": 7,
        "description": "",
        "reference": "Ahmad",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "I ask Allah the Almighty, Lord of the Mighty Throne, to heal you."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Al-Bukhari",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "O Allah, Lord of the people, remove the harm, and heal. You are the Healer, there is no healing except Your healing, a healing that leaves no illness."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Ahmad",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "O Allah, heal Your servant, and confirm Your Messenger."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Ahmad",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "O Allah, bless him, and remove from him the heat of the eye, its cold, and its fatigue."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "O Allah, we ask You for the good that Your Prophet Muhammad (peace be upon him) asked You for, and we seek refuge in You from the evil from which Your Prophet Muhammad (peace be upon him) sought refuge. You are the One whose help is sought, and upon You is the conveyance, and there is no power or strength except with Allah."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Ahmad",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "There is no god but Allah the Almighty, the Forbearing. There is no god but Allah, Lord of the Noble Throne. There is no god but Allah, Lord of the heavens and Lord of the Noble Throne."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": 3,
        "description": "",
        "reference": "Abu Dawood",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "Our Lord Allah who is in the heaven, sanctified be Your name. Your command is in the heaven and the earth. As Your mercy is in the heaven, make Your mercy in the earth. Forgive us our sins and our errors. You are the Lord of the good ones. Send down mercy from Your mercy, and healing from Your healing upon this pain, so that it heals."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Ahmad",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "I seek refuge in the perfect words of Allah which neither the righteous nor the wicked can transcend, from the evil of what He has created, brought into being, and originated, from the evil of what descends from the sky, and from the evil of what ascends in it, from the evil of what He originated in the earth, and from the evil of what emerges from it, from the evil of the trials of night and day, and from the evil of every knocker except a knocker who knocks with good, O Merciful."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": 3,
        "description": "",
        "reference": "Abu Dawood",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Abu Dawood",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "I seek refuge in the perfect words of Allah from His anger and His punishment, from the evil of His servants, and from the insinuations of the devils and from their presence."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "In the name of Allah the Great, I seek refuge in Allah the Greatest from the evil of every throbbing vein, and from the evil of the heat of the fire."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Al-Bukhari",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "In the name of Allah, the soil of our land, with the saliva of some of us, our sick will be healed, with the permission of our Lord."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": 7,
        "description": "",
        "reference": "Ahmad",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "I ask Allah the Almighty, Lord of the Mighty Throne, to grant you well-being and heal you."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Al-Tirmidhi",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "O Allah, cool my heart with snow, hail, and cold water. O Allah, purify my heart from sins as You purify the white garment from dirt."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Abu Dawood",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "O Allah, I seek refuge in Your Noble Face and Your perfect words from the evil of what You hold by its forelock. O Allah, You remove debt and sin. O Allah, Your army is not defeated, Your promise is not broken, and the wealth of the wealthy does not avail against You. Glory be to You and praise."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "In the name of Allah, He heals you, and from every illness He cures you, and from the evil of the envier when he envies, and the evil of every possessor of an eye."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Ahmad",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "O Allah, heal Your servant, he may harm an enemy for You or walk to prayer for You."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Al-Bukhari",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "O Allah, send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Ibrahim and upon the family of Ibrahim, indeed You are Praiseworthy, Glorious. O Allah, bless Muhammad and the family of Muhammad as You blessed Ibrahim and the family of Ibrahim in the worlds, indeed You are Praiseworthy, Glorious."
    },
    {
        "category": "Legitimate Ruqyah from the Prophetic Sunnah",
        "count": "",
        "description": "",
        "reference": "Muslim",
        "search": "Legitimate Ruqyah from the Prophetic Sunnah",
        "zekr": "In the name of Allah, I perform Ruqyah for you, from everything that harms you, and from the evil of every soul or envious eye, Allah heals you, in the name of Allah I perform Ruqyah for you."
    },
    {
        "category": "For the one who wakes up at night",
        "count": 1,
        "description": "",
        "reference": "Al-Bukhari",
        "search": "For the one who wakes up at night",
        "zekr": "Whoever wakes up at night and says: There is no god but Allah alone, no partner for Him, to Him belongs sovereignty and to Him belongs praise, and He is over all things competent. Praise be to Allah, Glory be to Allah, There is no god but Allah, Allah is the Greatest, There is no power or strength except with Allah. Then says: O Allah, forgive me, or supplicates; it will be answered for him. If he performs ablution and prays, his prayer will be accepted."
    },
    {
        "category": "Places and Times for Answering Supplications",
        "count": null,
        "description": "(The supplication is not rejected between the Adhan and the Iqamah)",
        "reference": "Abu Dawood",
        "search": "Places and Times for Answering Supplications",
        "zekr": "Between the Adhan and the Iqamah"
    },
    {
        "category": "Places and Times for Answering Supplications",
        "count": null,
        "description": "\"The closest a servant is to his Lord is when he is prostrating, so increase supplication.\"",
        "reference": "Muslim",
        "search": "Places and Times for Answering Supplications",
        "zekr": "In prostration"
    },
    {
        "category": "Places and Times for Answering Supplications",
        "count": null,
        "description": "(Friday has twelve hours, there is no Muslim servant who asks Allah for something in it except He gives it to him, so seek it in the last hour after Asr)",
        "reference": "Abu Dawood",
        "search": "Places and Times for Answering Supplications",
        "zekr": "An hour on Friday"
    },
    {
        "category": "Places and Times for Answering Supplications",
        "count": null,
        "description": "Our Lord, Blessed and Exalted, descends every night to the lowest heaven when the last third of the night remains, saying: 'Who supplicates Me so that I may answer him? Who asks Me so that I may give him? Who seeks My forgiveness so that I may forgive him?'",
        "reference": "Al-Bukhari",
        "search": "Places and Times for Answering Supplications",
        "zekr": "The last third of the night"
    },
    {
        "category": "Places and Times for Answering Supplications",
        "count": null,
        "description": "Two are not rejected: (Supplication at the call to prayer and under the rain)",
        "reference": "Abu Dawood",
        "search": "Places and Times for Answering Supplications",
        "zekr": "When rain falls"
    },
    {
        "category": "Places and Times for Answering Supplications",
        "count": null,
        "description": "\"If you hear the crowing of roosters, ask Allah for His bounty, for they have seen an angel.\"",
        "reference": "Al-Bukhari",
        "search": "Places and Times for Answering Supplications",
        "zekr": "When hearing the crowing of roosters"
    },
    {
        "category": "Places and Times for Answering Supplications",
        "count": null,
        "description": "Whoever wakes up (i.e., awakens) at night and says: There is no god but Allah alone, no partner for Him, to Him belongs sovereignty and to Him belongs praise, and He is over all things competent. Praise be to Allah, Glory be to Allah, There is no god but Allah, Allah is the Greatest, There is no power or strength except with Allah. Then says: O Allah, forgive me, or supplicates, it will be answered for him. If he performs ablution and prays, his prayer will be accepted.\"",
        "reference": "Al-Bukhari",
        "search": "Places and Times for Answering Supplications",
        "zekr": "When waking up at night"
    }
]