Repository: MahmoudMagdy001/Muslim
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Muslim
ar: مُسَلِّم

source: App Version
ar: إصدار التطبيق

# arabicLanguage
source: Arabic
ar: العربية

source: Azkar
ar: الأذكار

# azkarButton
source: Azkar
ar: الأذكار

# azkarCategoryList
source: Azkar Categories
ar: قائمة أنواع الأذكار

# azkarError
source: No Azkar available right now
ar: لا توجد أذكار متاحة حاليًا

# azkarLoadingText
source: Loading Azkar...
ar: جاري تحميل الأذكار...

# beneficiaries
source: The eight categories of Zakat recipients:
ar: مصارف الزكاة الثمانية:

# bigFont
source: Large
ar: كبير

# bismillah
source: In the name of Allah, the Most Gracious, the Most Merciful
ar: بسم الله الرحمن الرحيم

# bookmarksText
source: Bookmarks
ar: العلامات

# bookmarkVerse
source: Bookmark this verse
ar: حفظ علامة على هذه الآية

# bookmarkVerseSuccess
source: Bookmark saved for verse number
ar: تم حفظ علامة على آية رقم

# calculate_easily
source: Calculate your Zakat easily and accurately
ar: احسب زكاتك بسهولة ودقة

source: Calculate Zakat
ar: احسب الزكاة

# cancelButton
source: Cancel
ar: إلغاء

# cause_of_allah
source: In the cause of Allah
ar: في سبيل الله

# cause_of_allah_desc
source: To support Islamic work and charity.
ar: لدعم الدعوة والخير.

source: Change Font Size
ar: تغيير حجم الخط

source: Change Language
ar: تغيير اللغه

# changeReciterSuccess
source: Reciter changed to
ar: تم تغيير القارئ إلى

source: Change Theme
ar: تغيير المظهر

source: Chapters
ar: الأبواب

# chaptersEmpty
source: No chapters available
ar: لا توجد أبواب

# chaptersSearch
source: Search for a chapter...
ar: ابحث عن باب...

# chooseGoal
source: Set goal
ar: تحديد الهدف

# clear
source: Clear goal
ar: إزالة الهدف

# collectors
source: Those employed to collect Zakat
ar: العاملين عليها

# collectors_desc
source: Those who collect and distribute Zakat.
ar: من يجمعون الزكاة ويوزعونها.

# compassLoading
source: Preparing compass...
ar: جاري تجهيز البوصلة...

# completeTasbeh
source: You have completed it
ar: لقد أكملت

# condition_1
source: The Muslim must be free and own the nisab.
ar: أن يكون المسلم حرًّا مالكًا للنصاب.

# condition_2
source: Wealth must reach the nisab (approximately 85 grams of gold).
ar: أن يبلغ المال النصاب (ما يعادل 85 جرام ذهب تقريبًا).

# condition_3
source: A full lunar year must pass on the wealth.
ar: أن يمر على المال حول كامل (سنة هجرية).

# condition_4
source: The wealth must be growing or capable of growth.
ar: أن يكون المال ناميًا أو قابلًا للنماء.

# conditions
source: Zakat becomes obligatory when these conditions are met:
ar: تجب الزكاة عند توافر هذه الشروط:

# congrates
source: Congratulations
ar: تهانينا

# continueTasbeh
source: Continue
ar: أكمل

source: Crops
ar: الزروع

# crops_zakat_description
source: Zakat is due if the crop reaches approximately {nisab_kg} kg. {natural_rate}% if irrigated by rain or rivers {machine_rate}% if irrigated by machines (costly irrigation)
ar: تجب الزكاة إذا بلغ المحصول {nisab_kg} كجم تقريبًا. {natural_rate}% إن كانت تُسقى بماء المطر أو الأنهار {machine_rate}% إن كانت بالآلات (مكلفة السقي)

# crops_zakat_hint
source: Enter crop quantity in kilograms
ar: أدخل كمية المحصول بالكيلوجرام

# crops_zakat_title
source: 🌾 Crops Zakat
ar: 🌾 زكاة الزروع والثمار

source: Dark Mode
ar: الوضع الليلي

# debtors
source: Those in debt
ar: الغارمين

# debtors_desc
source: Those burdened by debt.
ar: من أثقلهم الدين.

# defultFont
source: Default
ar: افتراضي

source: Delete bookmark
ar: حذف العلامة

# deleteBookmarkQuestion
source: Are you sure you want to delete the bookmark from Surah
ar: هل أنت متأكد أنك تريد حذف العلامة من سورة

# deleteBookmarkSuccess
source: Bookmark deleted from Surah
ar: تم حذف العلامة من سورة

# deleteButton
source: Delete
ar: حذف

# distanceToKabaa
source: Distance to Kaaba:
ar: المسافة إلى الكعبة:

source: Due Zakat
ar: الزكاة المستحقة

# emptyBookmarks
source: No bookmarks yet
ar: لا توجد علامات بعد

# emptyTafsir
source: No tafsir available right now
ar: لا يوجد تفسير متاح حاليًا

# englishLanguage
source: English
ar: الانجليزية

# enter_amount
source: Enter your wealth amount and we will calculate your due Zakat
ar: أدخل قيمة أموالك وسنحسب لك مقدار الزكاة الواجبة

# errorMain
source: Error:
ar: حدث خطأ:

# fullMapQiblah
source: Qiblah Map
ar: خريطة القبلة

source: Goal
ar: الهدف

# goalExample
source: Enter your goal (e.g. 50)
ar: ضع هدفك (مثلاً 50)

source: Gold
ar: الذهب

# gold_price_error
source: Failed to load gold price
ar: تعذر تحميل سعر الذهب

# gold_zakat_description
source: The nisab for gold is {nisab_grams} grams. Rate: {percentage}% of the market value of gold. Current price per gram: {current_price} EGP
ar: النصاب في الذهب هو {nisab_grams} جرام. النسبة: {percentage}% من القيمة السوقية للذهب. سعر الجرام الحالي: {current_price} جنيه

# gold_zakat_hint
source: Enter gold weight in grams
ar: أدخل وزن الذهب بالجرام

# gold_zakat_title
source: 🪙 Gold Zakat
ar: 🪙 زكاة الذهب

# hadith
source: The Prophet ﷺ said: "There is no Zakat on property until a year passes on it."
ar: قال النبي ﷺ: "لا زكاة في مال حتى يحول عليه الحول."

source: Hadith Books
ar: كتب الحديث

# hadithBooksEmpty
source: No books available
ar: لا توجد كتب متاحة

# hadithBooksError
source: Failed to load books
ar: فشل في جلب الكتب

# hadithBooksSearch
source: Search by book name...
ar: ابحث باسم الكتاب...

# hadithButton
source: Hadith
ar: الحديث

# hadithError
source: Failed to load hadiths
ar: فشل في تحميل الأحاديث

# hadithStatus
source: Status
ar: الحكم

# hadithsTitle
source: Hadiths
ar: الأحاديث

# homeTitle
source: Home
ar: الصفحة الرئيسية

# invalid_input_error
source: Please enter a valid value
ar: الرجاء إدخال قيمة صحيحة

source: Light Mode
ar: الوضع النهاري

source: Loading...
ar: جاري التحميل...

source: Loading gold price...
ar: جاري تحميل سعر الذهب...

# machine_irrigation_subtitle
source: Irrigation by machines or with costs
ar: السقي بالآلات أو بتكاليف

# machine_irrigation_title
source: ⚙️ Machine or costly ({rate}%)
ar: ⚙️ آلة أو مكلف ({rate}%)

source: Money
ar: المال

# money_zakat_description
source: Zakat is due on money if it reaches the nisab ({nisab} EGP approximately) and a full lunar year has passed. Rate: {percentage}% of total saved money
ar: تجب الزكاة في المال إذا بلغ النصاب ({nisab} جنيه تقريبًا) ومر عليه حول قمري كامل. النسبة: {percentage}% من إجمالي المال المدخر

# money_zakat_hint
source: Enter total saved money in EGP
ar: أدخل إجمالي المال المدخر بالجنيه

# money_zakat_title
source: 💰 Money Zakat
ar: 💰 زكاة المال

# morePrayerTimesButton
source: Tap to view more prayer times
ar: اضغط لعرض المزيد من أوقات الصلاة

source: My Zakat
ar: زكاتي

source: Names of Allah
ar: أسماء الله الحسنى

# natural_irrigation_subtitle
source: Natural irrigation without costs
ar: السقي الطبيعي بدون تكاليف

# natural_irrigation_title
source: 💧 Rain or rivers ({rate}%)
ar: 💧 مطر أو أنهار ({rate}%)

# needy
source: The needy
ar: المساكين

# needy_desc
source: Those who have some of their needs but not enough.
ar: من يملك بعض حاجته ولكن لا يكفيه.

# new_muslims
source: Those whose hearts are to be reconciled
ar: المؤلفة قلوبهم

# new_muslims_desc
source: Those who are to be inclined towards Islam.
ar: من يُراد تأليف قلوبهم على الإسلام.

# noInternet
source: No internet connection
ar: لا يوجد اتصال بالإنترنت

# note
source: Note: Zakat is obligatory on saved wealth that reaches the nisab and a year has passed on it.
ar: ملاحظة: الزكاة واجبة على المال المدخر الذي بلغ النصاب ومر عليه الحول.

# numberOfChapters
source: Chapters:
ar: عدد الأبواب:

# numberOfHadiths
source: Hadiths:
ar: عدد الأحاديث:

# okButton
source: OK
ar: حسنًا

# playVerseSound
source: Play from this verse
ar: تشغيل من هذه الآية

# poor
source: The poor
ar: الفقراء

# poor_desc
source: Those who do not have enough for their daily needs.
ar: من لا يملك قوت يومه.

# prayerTimesText
source: Prayer Times
ar: مواقيت الصلاة

# privacy
source: Privacy Policy
ar: سياسة الخصوصية

# qiblahButton
source: Qiblah
ar: القبلة

source: Qiblah Direction
ar: اتجاه القبلة

# quran_text
source: Zakat is for the poor and the needy and those employed to collect it and for bringing hearts together and for freeing captives and for those in debt and for the cause of Allah and for the traveler
ar: إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ

# quran_verse
source: Allah says:
ar: قال الله تعالى:

# quranButton
source: Qur'an
ar: القرآن

# quranText
source: The Holy Qur'an
ar: القرآن الكريم

source: Refresh gold price
ar: تحديث سعر الذهب

source: Reset
ar: إعادة

# resetTasbeh
source: Restart
ar: إعادة من البداية

source: Retry
ar: إعادة المحاولة

# revision
source: Reference
ar: المرجع

# salahDirection
source: Aligned with Kaaba
ar: مُحاذٍ للكعبة

source: Save
ar: حفظ

# searchForSurahName
source: Search by Surah name...
ar: ابحث باسم السورة...

# searchResult
source: Search Results:
ar: نتائج البحث:

# sebha
source: Digital Tasbeeh
ar: السبحة

# sebhaTitle
source: Digital Tasbeeh
ar: السبحة الإلكترونية

source: Select Font Size
ar: اختر حجم الخط

source: Select Language
ar: اختر اللغة

source: Select Reciter
ar: اختر القارئ

source: Select Tafsir
ar: اختر التفسير

source: Select Theme
ar: اختيار المظهر

# settingsButton
source: Settings
ar: الإعدادات

source: Share Tafsir
ar: مشاركة التفسير

# slaves
source: For freeing slaves
ar: في الرقاب

# slaves_desc
source: To free captives or those oppressed by debt.
ar: لتحرير الأسرى أو المديونين ظلمًا.

# smallFont
source: Small
ar: صغير

# start_calculation
source: Start Zakat Calculation
ar: ابدأ حساب الزكاة

# surahsText
source: Surahs
ar: السور

source: System Mode
ar: حسب النظام

# tafsirVerse
source: Verse Interpretation
ar: تفسير الآية

# tasbehQuestion
source: Do you want to restart the count or continue?
ar: هل تريد إعادة العد من البداية أم تكمل

# tasbih
source: Tasbeeh
ar: التسبيح

source: Trade
ar: التجارة

# trade_zakat_description
source: Zakat is calculated on: (Goods value + Cash - Debts) × {percentage}% Due after a full year. Nisab: {nisab} EGP
ar: تحسب الزكاة على: (قيمة البضائع + النقد - الديون) × {percentage}% تجب بعد مرور الحول. النصاب: {nisab} جنيه

# trade_zakat_hint
source: Enter net trade assets in EGP
ar: أدخل صافي أصول التجارة بالجنيه

# trade_zakat_title
source: 🛍️ Trade Zakat
ar: 🛍️ زكاة التجارة

# traveler
source: The wayfarer
ar: ابن السبيل

# traveler_desc
source: A traveler who is cut off from his resources.
ar: المسافر المنقطع عن بلده.

# unit_kg
source: kg
ar: كجم

source: Update Prayer Times
ar: تحديث مواقيت الصلاة

source: Version
ar: الإصدار

# when_zakat_due
source: When is Zakat due?
ar: متى تجب الزكاة؟

# writer
source: Author
ar: المؤلف

# zakat
source: My Zakat
ar: زكاتي

source: Zakat Calculator
ar: حاسبة الزكاة

# zakat_for_whom
source: Who is Zakat for?
ar: لمن الزكاة؟

# zakat_reminder
source: Remember: Zakat is only obligatory if wealth reaches nisab and a year has passed
ar: تذكر: الزكاة واجبة فقط إذا بلغ المال النصاب ومر عليه الحول

# zakatDuaa
source: The Prophet ﷺ said: 'Charity does not decrease wealth.'
ar: قال ﷺ: ما نقص مالٌ من صدقةٍ.

# zakatStart
source: Start calculating your Zakat and remember its great reward
ar: ابدأ الآن بحساب زكاتك وتذكّر فضلها العظيم

source: About Us
ar: من نحن

source: App Notifications
ar: إشعارات التطبيق

source: Enable Prayer Notifications
ar: تفعيل إشعارات الأذان

source: Enable Quran Reminders
ar: تفعيل إشعارات تذكير القرآن

source: Prayer notifications enabled
ar: تم تفعيل إشعارات الأذان

source: Prayer notifications disabled
ar: تم تعطيل إشعارات الأذان

source: Quran reminders enabled
ar: تم تفعيل إشعارات تذكير القرآن

source: Quran reminders disabled
ar: تم تعطيل إشعارات تذكير القرآن

# quranReminderTitle
source: 📖 Quran Reading Reminder
ar: 📖 تذكير بقراءة القرآن

# quranReminderBody
source: Don't forget your daily Quran reading 🌿
ar: لا تنس وردك من القرآن الكريم 🌿
